project/RailsProject/app/controllers/passangers_controller.rb

  def index
    @passangers = Passanger.all
---
SELECT "passangers".* FROM "passangers"

  def create
    @passanger = Passanger.new(passanger_params)

    respond_to do |format|
      if @passanger.save
---
INSERT INTO "passangers" ("first_name", "last_name", "items_count", "items_weight", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "Bob"], ["last_name", "Bob"], ["items_count", 10], ["items_weight", 123.0], ["created_at", "2023-11-28 16:33:13.371008"], ["updated_at", "2023-11-28 16:33:13.371008"]]

  def update
    respond_to do |format|
      if @passanger.update(passanger_params)
---
UPDATE "passangers" SET "items_weight" = ?, "updated_at" = ? WHERE "passangers"."id" = ?  [["items_weight", 24.0], ["updated_at", "2023-11-28 17:52:37.926620"], ["id", 3]]

  def destroy
    @passanger.destroy
---
DELETE FROM "passangers" WHERE "passangers"."id" = ?  [["id", 2]]

    def set_passanger
      @passanger = Passanger.find(params[:id])
---
SELECT "passangers".* FROM "passangers" WHERE "passangers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]